chlipounni/Data_Looger/DataLogger.ioc
FATFS0.BSP.condition=
ADC1.OffsetSignedSaturation-2\#ChannelRegularConversion=DISABLE
PA10.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_OD
VP_USB_DEVICE_VS_USB_DEVICE_CDC_FS.Mode=CDC_FS
ADC1.Channel-1\#ChannelRegularConversion=ADC_CHANNEL_3
RCC.AXIClockFreq_Value=48000000
ProjectManager.RegisterCallBack=
PE0.Locked=true
RCC.USBFreq_Value=48000000
PD10.GPIO_Label=BP
VP_TIM3_VS_ClockSourceINT.Signal=TIM3_VS_ClockSourceINT
PE11.Signal=GPIO_Output
PB14.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_OD
Dma.ADC3.3.SyncRequestNumber=1
RCC.CKPERFreq_Value=64000000
PD2.Mode=SD_1_bit_auto_dir_voltage_converter
board=custom
Dma.UART4_TX.1.SyncRequestNumber=1
Dma.ADC3.3.MemDataAlignment=DMA_MDATAALIGN_HALFWORD
Dma.UART4_RX.0.Priority=DMA_PRIORITY_LOW
PD11.GPIOParameters=GPIO_Label
RCC.VCOInput1Freq_Value=16000000
FATFS.USE_DMA_CODE_SD=0
RCC.APB2Freq_Value=48000000
Dma.ADC3.3.Priority=DMA_PRIORITY_LOW
MxCube.Version=6.2.1
VP_TIM2_VS_ClockSourceINT.Mode=Internal
RCC.FDCANFreq_Value=48000000
PB15.GPIO_Speed=GPIO_SPEED_FREQ_LOW
RCC.ADCFreq_Value=37500000
VP_SYS_VS_Systick.Mode=SysTick
PA10.GPIOParameters=GPIO_Speed,PinState,GPIO_Label,GPIO_ModeDefaultOutputPP
Dma.UART4_RX.0.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode,SignalID,Polarity,RequestNumber,SyncSignalID,SyncPolarity,SyncEnable,EventEnable,SyncRequestNumber
PD14.GPIO_Label=test2
VP_TIM3_VS_no_output4.Signal=TIM3_VS_no_output4
Dma.ADC3.3.RequestNumber=1
Dma.UART4_RX.0.RequestNumber=1
PB15.GPIOParameters=GPIO_Speed,PinState,GPIO_Label,GPIO_ModeDefaultOutputPP
ADC1.NbrOfConversion=2
ADC1.OffsetNumber-2\#ChannelRegularConversion=ADC_OFFSET_NONE
PC13.Mode=WakeUp2
RCC.IPParameters=ADCFreq_Value,AHB12Freq_Value,AHB4Freq_Value,APB1Freq_Value,APB2Freq_Value,APB3Freq_Value,APB4Freq_Value,AXIClockFreq_Value,CECFreq_Value,CKPERFreq_Value,CortexFreq_Value,CpuClockFreq_Value,D1CPREFreq_Value,D2PPRE1,DFSDMACLkFreq_Value,DFSDMFreq_Value,DIVM1,DIVM2,DIVN1,DIVN2,DIVP1Freq_Value,DIVP2,DIVP2Freq_Value,DIVP3Freq_Value,DIVQ1,DIVQ1Freq_Value,DIVQ2Freq_Value,DIVQ3Freq_Value,DIVR1Freq_Value,DIVR2Freq_Value,DIVR3Freq_Value,FDCANFreq_Value,FMCFreq_Value,FamilyName,HCLK3ClockFreq_Value,HCLKFreq_Value,HPRE,HRTIMFreq_Value,HSE_VALUE,I2C123Freq_Value,I2C4Freq_Value,LPTIM1Freq_Value,LPTIM2Freq_Value,LPTIM345Freq_Value,LPUART1Freq_Value,LTDCFreq_Value,MCO1PinFreq_Value,MCO2PinFreq_Value,PLL2FRACN,PLLFRACN,PLLSourceVirtual,QSPIFreq_Value,RNGFreq_Value,RTCFreq_Value,SAI1Freq_Value,SAI23Freq_Value,SAI4AFreq_Value,SAI4BFreq_Value,SDMMCFreq_Value,SPDIFRXFreq_Value,SPI123Freq_Value,SPI45Freq_Value,SPI6Freq_Value,SWPMI1Freq_Value,SYSCLKFreq_VALUE,SYSCLKSource,Tim1OutputFreq_Value,Tim2OutputFreq_Value,TraceFreq_Value,USART16Freq_Value,USART234578Freq_Value,USBFreq_Value,VCO1OutputFreq_Value,VCO2OutputFreq_Value,VCO3OutputFreq_Value,VCOInput1Freq_Value,VCOInput2Freq_Value,VCOInput3Freq_Value
PE11.Locked=true
ProjectManager.AskForMigrate=true
Mcu.Name=STM32H743VGTx
PE0.Signal=GPIO_Output
ADC3.ConversionDataManagement=ADC_CONVERSIONDATA_DMA_CIRCULAR
PE7.GPIO_Label=Amp_3
PD0.Mode=Asynchronous
FATFS._MAX_SS=512
Mcu.IP8=PWR
Mcu.IP9=RCC
PD14.Signal=GPIO_Output
Mcu.IP6=FATFS
Mcu.IP7=NVIC
ProjectManager.CoupleFile=false
RCC.SYSCLKFreq_VALUE=96000000
Dma.ADC1.2.Priority=DMA_PRIORITY_LOW
RCC.I2C123Freq_Value=24000000
PA12.Mode=Device_Only
Dma.ADC1.2.PeriphInc=DMA_PINC_DISABLE
KeepUserPlacement=false
PC14-OSC32_IN\ (OSC32_IN).Signal=RCC_OSC32_IN
Dma.ADC1.2.SyncRequestNumber=1
NVIC.EXTI9_5_IRQn=true\:12\:0\:true\:false\:true\:true\:true
Dma.UART4_TX.1.Priority=DMA_PRIORITY_LOW
PC6.GPIOParameters=GPIO_Speed,PinState,GPIO_Label,GPIO_ModeDefaultOutputPP
RCC.SAI4AFreq_Value=48000000
ADC1.NbrOfConversionFlag=1
FATFS0.BSP.component=
PC3_C.Signal=ADC3_INP1
RCC.DIVQ1Freq_Value=48000000
PC2_C.GPIOParameters=GPIO_Label
PB8.Signal=SDMMC1_CKIN
Dma.UART4_TX.1.SignalID=NONE
SH.ADCx_INP3.ConfNb=1
RCC.VCOInput2Freq_Value=16000000
PD9.Locked=true
RCC.APB1Freq_Value=24000000
PD8.PinState=GPIO_PIN_RESET
ADC3.NbrOfConversionFlag=1
ProjectManager.DeviceId=STM32H743VGTx
PB12.Signal=GPIO_Output
Dma.ADC3.3.SignalID=NONE
ProjectManager.LibraryCopy=1
PB1.GPIOParameters=GPIO_Label
PB4\ (NJTRST).Signal=GPIO_Output
PA6.Locked=true
isbadioc=false
